           02 REG-NUMBER PIC X(4).
           02 BANK-NAME PIC X(30).
           02 BANK-ADDRESS PIC X(50).
           02 PHONE-NUMBER PIC X(15).
           02 EMAIL-ADDRESS PIC X(30).
           