           02 CPR PIC X(15).
           02 CUSTOMER-NAME PIC X(30).
           02 CUSTOMER-ADDRESS PIC X(50).
           02 DATE-OF-BIRTH PIC X(10).
           02 ACCOUNT-ID PIC X(15).
           02 REG-NUMBER PIC X(4).
           02 AMOUNT PIC X(17).
           02 CURRENCY-CODE PIC X(3).
           02 TRANSACTION-TYPE PIC X(21).
           02 STORE PIC X(20).
           02 TRANSACTION-DATE PIC X(26).
           