       IDENTIFICATION DIVISION.
       PROGRAM-ID. OPGAVE3.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 COSTUMER-ID PIC X(10) VALUE SPACES.
       01 COSTUMER-FIRSTNAME PIC X(20) VALUE SPACES.
       01 COSTUMER-LASTNAME PIC X(20) VALUE SPACES.
       01 COSTUMER-FULLNAME PIC X(40) VALUE SPACES.
       01 ACCOUNT-NUMBER PIC X(20) VALUE SPACES.
       01 ACCOUNT-BALANCE PIC 9(7)V99 VALUE ZEROS.
       01 CURRENCY-CODE PIC X(3) VALUE SPACES.

       PROCEDURE DIVISION.

       MOVE "CUST-001" TO COSTUMER-ID.
       MOVE "John" TO COSTUMER-FIRSTNAME.
       MOVE "Doe" TO COSTUMER-LASTNAME.
       MOVE "ACC-001" TO ACCOUNT-NUMBER.
       MOVE 1000.00 TO ACCOUNT-BALANCE.
       MOVE "USD" TO CURRENCY-CODE.
       STRING COSTUMER-FIRSTNAME DELIMITED BY SPACE 
              " " DELIMITED BY SIZE 
              COSTUMER-LASTNAME DELIMITED BY SPACE
              INTO COSTUMER-FULLNAME
       END-STRING.
      *Nedenfor kommer en display - Cobols måde at skrive i konsollen
       DISPLAY "----------------------------------------"
       DISPLAY "Customer ID : " COSTUMER-ID.
       DISPLAY "Customer Name : " COSTUMER-FULLNAME.
       DISPLAY "Account Number : " ACCOUNT-NUMBER.
       DISPLAY "Account Balance : " ACCOUNT-BALANCE " " CURRENCY-CODE.
       STOP RUN.
